IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DEBUG-VAL PIC X(1).
01 I PIC 9(3).
01 REM-15 PIC 9(3).
01 REM-3 PIC 9(3).
01 REM-5 PIC 9(3).
01 RED PIC X(5) VALUE X'1B5B33316D'.
01 GREEN PIC X(5) VALUE X'1B5B33326D'.
01 BLUE PIC X(5) VALUE X'1B5B33346D'.
01 CLR PIC X(4) VALUE X'1B5B306D'.
PROCEDURE DIVISION.
    DISPLAY 'DEBUG' UPON ENVIRONMENT-NAME
    ACCEPT DEBUG-VAL FROM ENVIRONMENT-VALUE
    IF DEBUG-VAL = '1'
        DISPLAY 'test ... ok'
        STOP RUN
    END-IF
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
        DIVIDE I BY 15 GIVING REM-15 REMAINDER REM-15
        DIVIDE I BY 3 GIVING REM-3 REMAINDER REM-3
        DIVIDE I BY 5 GIVING REM-5 REMAINDER REM-5
        IF REM-15 = 0
            DISPLAY RED 'FizzBuzz' CLR
        ELSE IF REM-3 = 0
            DISPLAY GREEN 'Fizz' CLR
        ELSE IF REM-5 = 0
            DISPLAY BLUE 'Buzz' CLR
        ELSE
            DISPLAY I
        END-IF
    END-PERFORM
    STOP RUN.
