IDENTIFICATION DIVISION.
PROGRAM-ID. HELLOWORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DEBUG-VAL PIC X(1).
PROCEDURE DIVISION.
    DISPLAY 'DEBUG' UPON ENVIRONMENT-NAME
    ACCEPT DEBUG-VAL FROM ENVIRONMENT-VALUE
    IF DEBUG-VAL = '1'
        DISPLAY 'test ... ok'
        STOP RUN
    END-IF
    DISPLAY 'Hello World'.
    STOP RUN.
